import { ILayout } from '../types';

const layout: Partial<ILayout> = {
	// 1 row
	'`': '',
	'~': '₴',
	'@': '"',
	'#': '№',
	'$': ';',
	'^': ':',
	'&': '?',

	// 2 row
	q: 'й',
	w: 'ц',
	e: 'у',
	r: 'к',
	t: 'е',
	y: 'н',
	u: 'г',
	i: 'ш',
	o: 'щ',
	p: 'з',
	'[': 'х',
	']': 'ї',
	Q: 'Й',
	W: 'Ц',
	E: 'У',
	R: 'К',
	T: 'Е',
	Y: 'Н',
	U: 'Г',
	I: 'Ш',
	O: 'Щ',
	P: 'З',
	'{': 'Х',
	'}': 'Ї',

	// 3 row
	a: 'ф',
	s: 'і',
	d: 'в',
	f: 'а',
	g: 'п',
	h: 'р',
	j: 'о',
	k: 'л',
	l: 'д',
	';': 'ж',
	"'": 'є',
	A: 'Ф',
	S: 'І',
	D: 'В',
	F: 'А',
	G: 'П',
	H: 'Р',
	J: 'О',
	K: 'Л',
	L: 'Д',
	':': 'Ж',
	'"': 'Є',

	// 4 row
	z: 'я',
	x: 'ч',
	c: 'с',
	v: 'м',
	b: 'и',
	n: 'т',
	m: 'ь',
	',': 'б',
	'.': 'ю',
	Z: 'Я',
	X: 'Ч',
	C: 'С',
	V: 'М',
	B: 'И',
	N: 'Т',
	M: 'Ь',
	'<': 'Б',
	'>': 'Ю',
};

export default layout;






